storage/tests/c3d11ef5-36a0-41c4-bb9a-0f0da1d65cb3/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/c3d11ef5-36a0-41c4-bb9a-0f0da1d65cb3/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s

running (11.0s), 08/10 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (12.0s), 08/10 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (13.0s), 05/10 VUs, 5 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (14.0s), 01/10 VUs, 9 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......: 50      3.359492/s
    checks_succeeded...: 100.00% 50 out of 50
    checks_failed......: 0.00%   0 out of 50

    ✓ status ok

    HTTP
    http_req_duration..............: avg=217.66ms min=3.84ms med=9.02ms max=1.1s   p(90)=716.28ms p(95)=787.98ms
      { expected_response:true }...: avg=217.66ms min=3.84ms med=9.02ms max=1.1s   p(90)=716.28ms p(95)=787.98ms
    http_req_failed................: 0.00% 0 out of 50
    http_reqs......................: 50    3.359492/s

    EXECUTION
    iteration_duration.............: avg=12.7s    min=10.42s med=12.95s max=14.88s p(90)=13.84s   p(95)=14.36s  
    iterations.....................: 10    0.671898/s
    vus............................: 1     min=1       max=10
    vus_max........................: 10    min=10      max=10

    NETWORK
    data_received..................: 22 kB 1.4 kB/s
    data_sent......................: 15 kB 1.0 kB/s



running (14.9s), 00/10 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s